from string import Template
#### RAG PROMPTS ####

#### System Prompt ####
system_prompt = Template("\n".join([
    "أنت مساعد لتوليد رد للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستعلام المستخدم.",
    "يجب عليك توليد الرد بناءً على المستندات المقدمة.",
    "تجاهل المستندات غير المرتبطة باستعلام المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد.",
    "يجب أن يكون الرد بنفس لغة استعلام المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا وموجزًا في ردك. تجنب المعلومات غير الضرورية.",
]))

#### Documents #####
document_prompt = Template("\n".join([
    "## المستند رقم: $doc_num",
    "### المحتوى: $chunk_text",
]))

#### Footer ####
footer_prompt = Template("\n".join([
    "استنادًا فقط إلى المستندات أعلاه، يرجى توليد إجابة للمستخدم.",
    "## الإجابة:",
]))
